# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'heroku/brew' # for `heroku` binary
tap 'thoughtbot/formulae' # for `pick` binary

# Binaries
brew 'heroku'
brew 'pick'
brew 'git'
brew 'tree'
brew 'autojump'
brew 'pure'

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Apps
cask 'caffeine'
cask 'cleanshot'
cask 'cursor'
cask 'figma'
cask 'firefox'
cask 'gather'
cask 'git-credential-manager'
cask 'github'
cask 'google-chrome'
cask 'keycastr'
cask 'linear'
cask 'loom'
cask 'maccy'
cask 'obs'
cask 'orbstack'
cask 'plex-media-server'
cask 'raycast'
cask 'rectangle'
cask 'screen-studio'
cask 'simplenote'
cask 'sketch'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'visual-studio-code'
cask 'vlc'
cask 'webtorrent'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Spark', id: 1176895641
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005