# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'heroku/brew' # for `heroku` binary
tap 'thoughtbot/formulae' # for `pick` binary

# Binaries
brew 'heroku'
brew 'pick'
brew 'hub'
brew 'tree'
brew 'autojump'

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Apps
cask 'google-chrome'
cask 'firefox'
cask 'visual-studio-code'
cask 'github'
cask 'simplenote'
cask 'sketch'
cask 'slack'
cask 'keycastr'
cask 'spotify'
cask 'vlc'
cask 'webtorrent'
cask 'keepingyouawake'
cask 'plex-media-server'
cask 'kap'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Spark', id: 1176895641
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005