# Taps
tap 'brevdev/brev'
tap 'cloudflare/cloudflare'
tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'loopwork-ai/tap'
tap 'planetscale/tap'
tap 'thoughtbot/formulae' # for `pick` binary
tap 'travisvn/tap'

# Binaries
brew 'act'
brew 'autojump'
brew 'brev'
brew 'cloudflared'
brew 'cog'
brew 'exiftool'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'go'
brew 'gptree'
brew 'imagemagick'
brew 'magic-wormhole'
brew 'node'
brew 'pick'
brew 'pscale'
brew 'pure'
brew 'rclone'
brew 'ripgrep'
brew 'slackdump'
brew 'tesseract'
brew 'tree'
brew 'wget'
brew 'yq'
brew 'yt-dlp'
brew 'uv'

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Apps
cask 'arc'
cask 'audacity'
cask 'autodesk-fusion'
cask 'caffeine'
cask 'chatgpt'
cask 'claude'
cask 'cleanshot'
cask 'cursor'
cask 'discord'
cask 'figma'
cask 'firefox'
cask 'gather'
cask 'ghostty'
cask 'git-credential-manager'
cask 'github'
cask 'google-chrome'
cask 'keycastr'
cask 'linear-linear'
cask 'lm-studio'
cask 'loom'
cask 'maccy'
cask 'mousepose'
cask 'ngrok'
cask 'notion'
cask 'obs'
cask 'orbstack'
cask 'plex-media-server'
cask 'raycast'
cask 'rectangle'
cask 'screen-studio'
cask 'shotcut'
cask 'signal'
cask 'simplenote'
cask 'sketch'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'telegram'
cask 'thunderbird'
cask 'visual-studio-code'
cask 'vlc'
cask 'warp'
cask 'webtorrent'
cask 'whatsapp'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

# Mac App Store
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Spark', id: 1176895641
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005